
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
    n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs

backbone:
  - [-1, 1, HGStem, [16, 32]]  # 0-P2/4

  - [0, 2, C3k2, [32, False, 0.25]] # 1-P2/4
  - [-1, 1, Conv, [64, 3, 2]] # 2-P3/8
  - [-1, 2, C3k2, [64, False, 0.25]] # 3-P3/8

  - [0, 3, Dynamic_HGBlock, [16, 32, 3]] # 4-P2/4
  - [-1, 1, DWConv, [64, 3, 2, 1, False]]  # 5-P3/8
  - [-1, 3, Dynamic_HGBlock, [32, 64, 3]]   # 6-P3/8

  - [[3, 6], 1, DynamicAlignFusion, [64]] # 7-P3/8

  - [7, 1, Conv, [128, 3, 2]]  # 8-P4/16
  - [-1, 2, C3k2, [128, True]] # 9-P4/16

  - [7, 1, DWConv, [128, 3, 2, 1, False]]  # 10-P4/16
  - [-1, 3, Dynamic_HGBlock, [64, 128, 5, True, False]]  # cm, c2, k, light, shortcut
  - [-1, 3, Dynamic_HGBlock, [64, 128, 5, True, True]]
  - [-1, 3, Dynamic_HGBlock, [64, 128, 5, True, True]]  # 13-P4/16

  - [[9, 13], 1, DynamicAlignFusion, [128]] # 14-P4/16

  - [14, 1, Conv, [256, 3, 2]]  # 15-P5/32
  - [-1, 2, C3k2, [256, True]] # 16-P5/32

  - [14, 1, DWConv, [256, 3, 2, 1, False]]  # 17-P5/32
  - [-1, 3, Dynamic_HGBlock, [128, 256, 5, True, False]]  # 18-P5/32

  - [[16, 18], 1, DynamicAlignFusion, [256]] # 19-P5/32
  - [-1, 1, SPPF, [1024, 5]] # 20-P5/32
  - [-1, 2, C2TSSA_DYT_Mona, [1024]] # 21

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 14], 1, MFM, [512]] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 24

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, MFM, [256]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 27 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 24], 1, MFM, [512]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 30 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 21], 1, MFM, [512]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 33 (P5/32-large)

  - [[27, 30, 33], 1, Detect, [nc]] # Detect(P3, P4, P5)